➜  dummy git:(master) clipsdos -f run.bat
         CLIPS (Cypher Beta 8/21/18)
CLIPS> (load 0_Main.clp)
+%%%%****%%$
TRUE
CLIPS> (load 1_Env.clp)
+%%%%%%**************!********
TRUE
CLIPS> (load ../maps/fleet0.clp)
$
TRUE
CLIPS> ;;(load 4_Deliberate.clp)
;;(load 5_Planning.clp)
(load 6_Heat.clp)
+%%!*******
TRUE
CLIPS> (load 3_Agent.clp)
+****!**
TRUE
CLIPS> (reset)
CLIPS> ;(watch focus)
(set-break game-over)
CLIPS> (run)


vado ad agent  step0
Fire on 4 6


vado ad agent  step1
Fire on 9 6


vado ad agent  step2
Fire on 4 2


vado ad agent  step3
Fire on 9 2


vado ad agent  step4
Fire on 0 0


vado ad agent  step5
CLIPS> (run 2)
CLIPS> (focus ENV)
TRUE
CLIPS> (facts)
f-1     (maxduration 100)
f-2     (status (step 5) (currently running))
f-3     (statistics (num_fire_ok 3) (num_fire_ko 2) (num_guess_ok 0) (num_guess_ko 0) (num_safe 0) (num_sink 0))
f-6     (moves (fires 0) (guesses 20))
f-7     (board (air-carriers 1 4) (cruisers 2 3) (destroyers 3 2) (submarines 4 1) (ordered air-carrier cruiser destroyer submarine) (median 6))
f-8     (heatset (values 4 0 3 5 7 6 8 9 11))
f-9     (cell (x 0) (y 0) (content hit-boat) (status fired))
f-10    (cell (x 0) (y 1) (content water) (status none))
f-11    (cell (x 0) (y 2) (content water) (status none))
f-12    (cell (x 0) (y 3) (content water) (status none))
f-13    (cell (x 0) (y 4) (content water) (status none))
f-14    (cell (x 0) (y 5) (content water) (status none))
f-15    (cell (x 0) (y 6) (content water) (status none))
f-16    (cell (x 0) (y 7) (content water) (status none))
f-17    (cell (x 0) (y 8) (content water) (status none))
f-18    (cell (x 0) (y 9) (content hit-boat) (status fired))
f-19    (cell (x 1) (y 0) (content water) (status none))
f-20    (cell (x 1) (y 1) (content water) (status none))
f-21    (cell (x 1) (y 2) (content water) (status none))
f-22    (cell (x 1) (y 3) (content water) (status none))
f-23    (cell (x 1) (y 4) (content water) (status none))
f-24    (cell (x 1) (y 5) (content water) (status none))
f-25    (cell (x 1) (y 6) (content water) (status none))
f-26    (cell (x 1) (y 7) (content water) (status none))
f-27    (cell (x 1) (y 8) (content water) (status none))
f-28    (cell (x 1) (y 9) (content water) (status none))
f-29    (cell (x 2) (y 0) (content water) (status none))
f-30    (cell (x 2) (y 1) (content water) (status none))
f-31    (cell (x 2) (y 2) (content water) (status none))
f-32    (cell (x 2) (y 3) (content water) (status none))
f-33    (cell (x 2) (y 4) (content water) (status none))
f-34    (cell (x 2) (y 5) (content water) (status none))
f-35    (cell (x 2) (y 6) (content water) (status none))
f-36    (cell (x 2) (y 7) (content water) (status none))
f-37    (cell (x 2) (y 8) (content water) (status none))
f-38    (cell (x 2) (y 9) (content water) (status none))
f-39    (cell (x 3) (y 0) (content water) (status none))
f-40    (cell (x 3) (y 1) (content water) (status none))
f-41    (cell (x 3) (y 2) (content water) (status none))
f-42    (cell (x 3) (y 3) (content water) (status none))
f-43    (cell (x 3) (y 4) (content boat) (status none))
f-44    (cell (x 3) (y 5) (content water) (status none))
f-45    (cell (x 3) (y 6) (content water) (status none))
f-46    (cell (x 3) (y 7) (content water) (status none))
f-47    (cell (x 3) (y 8) (content water) (status none))
f-48    (cell (x 3) (y 9) (content water) (status none))
f-49    (cell (x 4) (y 0) (content water) (status none))
f-50    (cell (x 4) (y 1) (content water) (status none))
f-51    (cell (x 4) (y 2) (content hit-boat) (status fired))
f-52    (cell (x 4) (y 3) (content water) (status none))
f-53    (cell (x 4) (y 4) (content boat) (status none))
f-54    (cell (x 4) (y 5) (content water) (status none))
f-55    (cell (x 4) (y 6) (content hit-boat) (status fired))
f-56    (cell (x 4) (y 7) (content water) (status none))
f-57    (cell (x 4) (y 8) (content water) (status none))
f-58    (cell (x 4) (y 9) (content water) (status none))
f-59    (cell (x 5) (y 0) (content boat) (status none))
f-60    (cell (x 5) (y 1) (content water) (status none))
f-61    (cell (x 5) (y 2) (content boat) (status none))
f-62    (cell (x 5) (y 3) (content water) (status none))
f-63    (cell (x 5) (y 4) (content boat) (status none))
f-64    (cell (x 5) (y 5) (content water) (status none))
f-65    (cell (x 5) (y 6) (content boat) (status none))
f-66    (cell (x 5) (y 7) (content water) (status none))
f-67    (cell (x 5) (y 8) (content boat) (status none))
f-68    (cell (x 5) (y 9) (content water) (status none))
f-69    (cell (x 6) (y 0) (content boat) (status none))
f-70    (cell (x 6) (y 1) (content water) (status none))
f-71    (cell (x 6) (y 2) (content boat) (status none))
f-72    (cell (x 6) (y 3) (content water) (status none))
f-73    (cell (x 6) (y 4) (content boat) (status none))
f-74    (cell (x 6) (y 5) (content water) (status none))
f-75    (cell (x 6) (y 6) (content boat) (status none))
f-76    (cell (x 6) (y 7) (content water) (status none))
f-77    (cell (x 6) (y 8) (content boat) (status none))
f-78    (cell (x 6) (y 9) (content water) (status none))
f-79    (cell (x 7) (y 0) (content water) (status none))
f-80    (cell (x 7) (y 1) (content water) (status none))
f-81    (cell (x 7) (y 2) (content water) (status none))
f-82    (cell (x 7) (y 3) (content water) (status none))
f-83    (cell (x 7) (y 4) (content water) (status none))
f-84    (cell (x 7) (y 5) (content water) (status none))
f-85    (cell (x 7) (y 6) (content water) (status none))
f-86    (cell (x 7) (y 7) (content water) (status none))
f-87    (cell (x 7) (y 8) (content water) (status none))
f-88    (cell (x 7) (y 9) (content water) (status none))
f-89    (cell (x 8) (y 0) (content water) (status none))
f-90    (cell (x 8) (y 1) (content water) (status none))
f-91    (cell (x 8) (y 2) (content water) (status none))
f-92    (cell (x 8) (y 3) (content water) (status none))
f-93    (cell (x 8) (y 4) (content boat) (status none))
f-94    (cell (x 8) (y 5) (content water) (status none))
f-95    (cell (x 8) (y 6) (content water) (status none))
f-96    (cell (x 8) (y 7) (content water) (status none))
f-97    (cell (x 8) (y 8) (content water) (status none))
f-98    (cell (x 8) (y 9) (content water) (status none))
f-99    (cell (x 9) (y 0) (content boat) (status none))
f-100   (cell (x 9) (y 1) (content water) (status none))
f-101   (cell (x 9) (y 2) (content water) (status missed))
f-102   (cell (x 9) (y 3) (content water) (status none))
f-103   (cell (x 9) (y 4) (content boat) (status none))
f-104   (cell (x 9) (y 5) (content water) (status none))
f-105   (cell (x 9) (y 6) (content water) (status missed))
f-106   (cell (x 9) (y 7) (content water) (status none))
f-107   (cell (x 9) (y 8) (content water) (status none))
f-108   (cell (x 9) (y 9) (content boat) (status none))
f-109   (boat-hor (name sub1) (x 0) (ys 0) (size 1) (status hit))
f-110   (boat-hor (name sub2) (x 0) (ys 9) (size 1) (status hit))
f-111   (boat-ver (name nav3) (xs 3 4 5 6) (y 4) (size 4) (status safe safe safe safe))
f-112   (boat-ver (name nav4) (xs 4 5 6) (y 2) (size 3) (status hit safe safe))
f-113   (boat-ver (name nav5) (xs 4 5 6) (y 6) (size 3) (status hit safe safe))
f-114   (boat-ver (name nav6) (xs 5 6) (y 0) (size 2) (status safe safe))
f-115   (boat-ver (name nav7) (xs 5 6) (y 8) (size 2) (status safe safe))
f-116   (boat-ver (name nav8) (xs 8 9) (y 4) (size 2) (status safe safe))
f-117   (boat-hor (name sub9) (x 9) (ys 0) (size 1) (status safe))
f-118   (boat-hor (name sub10) (x 9) (ys 9) (size 1) (status safe))
f-119   (k-cell (x 0) (y 9) (content sub))
f-120   (k-per-row (row 0) (num 2))
f-121   (k-per-row (row 1) (num 0))
f-122   (k-per-row (row 2) (num 0))
f-123   (k-per-row (row 3) (num 1))
f-124   (k-per-row (row 4) (num 3))
f-125   (k-per-row (row 5) (num 5))
f-126   (k-per-row (row 6) (num 5))
f-127   (k-per-row (row 7) (num 0))
f-128   (k-per-row (row 8) (num 1))
f-129   (k-per-row (row 9) (num 3))
f-130   (k-per-col (col 0) (num 4))
f-131   (k-per-col (col 1) (num 0))
f-132   (k-per-col (col 2) (num 3))
f-133   (k-per-col (col 3) (num 0))
f-134   (k-per-col (col 4) (num 6))
f-135   (k-per-col (col 5) (num 0))
f-136   (k-per-col (col 6) (num 3))
f-137   (k-per-col (col 7) (num 0))
f-138   (k-per-col (col 8) (num 2))
f-139   (k-per-col (col 9) (num 2))
f-140   (fire 0 9)
f-141   (resetted 0 9)
f-142   (considered 0 9)
f-143   (sink-boat sub2)
f-250   (exec (step 0) (action fire) (x 4) (y 6))
f-252   (fire 4 6)
f-253   (k-cell (x 4) (y 6) (content top))
f-254   (resetted 4 6)
f-255   (considered 4 6)
f-256   (k-cell (x 3) (y 5) (content water))
f-258   (k-cell (x 3) (y 6) (content water))
f-260   (k-cell (x 3) (y 7) (content water))
f-262   (k-cell (x 4) (y 5) (content water))
f-264   (k-cell (x 4) (y 7) (content water))
f-266   (k-cell (x 5) (y 5) (content water))
f-269   (k-cell (x 5) (y 7) (content water))
f-279   (exec (step 1) (action fire) (x 9) (y 6))
f-281   (fire 9 6)
f-282   (exec (step 2) (action fire) (x 4) (y 2))
f-284   (fire 4 2)
f-285   (k-cell (x 4) (y 2) (content top))
f-286   (resetted 4 2)
f-287   (considered 4 2)
f-288   (k-cell (x 3) (y 1) (content water))
f-290   (k-cell (x 3) (y 2) (content water))
f-292   (k-cell (x 3) (y 3) (content water))
f-294   (k-cell (x 4) (y 1) (content water))
f-296   (k-cell (x 4) (y 3) (content water))
f-298   (k-cell (x 5) (y 1) (content water))
f-301   (k-cell (x 5) (y 3) (content water))
f-311   (exec (step 3) (action fire) (x 9) (y 2))
f-313   (fire 9 2)
f-314   (exec (step 4) (action fire) (x 0) (y 0))
f-316   (fire 0 0)
f-317   (k-cell (x 0) (y 0) (content sub))
f-318   (resetted 0 0)
f-319   (considered 0 0)
f-320   (sink-boat sub1)
f-321   (k-cell (x 9) (y 2) (content water))
f-322   (k-cell (x 9) (y 6) (content water))
For a total of 177 facts.
CLIPS> (focus HEAT) 
TRUE
CLIPS> (facts)
f-1     (maxduration 100)
f-2     (status (step 5) (currently running))
f-3     (statistics (num_fire_ok 3) (num_fire_ko 2) (num_guess_ok 0) (num_guess_ko 0) (num_safe 0) (num_sink 0))
f-6     (moves (fires 0) (guesses 20))
f-7     (board (air-carriers 1 4) (cruisers 2 3) (destroyers 3 2) (submarines 4 1) (ordered air-carrier cruiser destroyer submarine) (median 6))
f-8     (heatset (values 4 0 3 5 7 6 8 9 11))
f-119   (k-cell (x 0) (y 9) (content sub))
f-120   (k-per-row (row 0) (num 2))
f-121   (k-per-row (row 1) (num 0))
f-122   (k-per-row (row 2) (num 0))
f-123   (k-per-row (row 3) (num 1))
f-124   (k-per-row (row 4) (num 3))
f-125   (k-per-row (row 5) (num 5))
f-126   (k-per-row (row 6) (num 5))
f-127   (k-per-row (row 7) (num 0))
f-128   (k-per-row (row 8) (num 1))
f-129   (k-per-row (row 9) (num 3))
f-130   (k-per-col (col 0) (num 4))
f-131   (k-per-col (col 1) (num 0))
f-132   (k-per-col (col 2) (num 3))
f-133   (k-per-col (col 3) (num 0))
f-134   (k-per-col (col 4) (num 6))
f-135   (k-per-col (col 5) (num 0))
f-136   (k-per-col (col 6) (num 3))
f-137   (k-per-col (col 7) (num 0))
f-138   (k-per-col (col 8) (num 2))
f-139   (k-per-col (col 9) (num 2))
f-144   (heat-map (x 0) (y 9) (h 4) (computed TRUE))
f-145   (heat-map (x 1) (y 9) (h 0) (computed TRUE))
f-146   (heat-map (x 2) (y 9) (h 0) (computed TRUE))
f-147   (heat-map (x 3) (y 9) (h 3) (computed TRUE))
f-148   (heat-map (x 4) (y 9) (h 5) (computed TRUE))
f-149   (heat-map (x 5) (y 9) (h 7) (computed TRUE))
f-150   (heat-map (x 6) (y 9) (h 7) (computed TRUE))
f-151   (heat-map (x 7) (y 9) (h 0) (computed TRUE))
f-152   (heat-map (x 8) (y 9) (h 3) (computed TRUE))
f-153   (heat-map (x 9) (y 9) (h 5) (computed TRUE))
f-154   (heat-map (x 0) (y 8) (h 4) (computed TRUE))
f-155   (heat-map (x 1) (y 8) (h 0) (computed TRUE))
f-156   (heat-map (x 2) (y 8) (h 0) (computed TRUE))
f-157   (heat-map (x 3) (y 8) (h 3) (computed TRUE))
f-158   (heat-map (x 4) (y 8) (h 5) (computed TRUE))
f-159   (heat-map (x 5) (y 8) (h 7) (computed TRUE))
f-160   (heat-map (x 6) (y 8) (h 7) (computed TRUE))
f-161   (heat-map (x 7) (y 8) (h 0) (computed TRUE))
f-162   (heat-map (x 8) (y 8) (h 3) (computed TRUE))
f-163   (heat-map (x 9) (y 8) (h 5) (computed TRUE))
f-164   (heat-map (x 0) (y 7) (h 0) (computed TRUE))
f-165   (heat-map (x 1) (y 7) (h 0) (computed TRUE))
f-166   (heat-map (x 2) (y 7) (h 0) (computed TRUE))
f-167   (heat-map (x 3) (y 7) (h 0) (computed TRUE))
f-168   (heat-map (x 4) (y 7) (h 0) (computed TRUE))
f-169   (heat-map (x 5) (y 7) (h 0) (computed TRUE))
f-170   (heat-map (x 6) (y 7) (h 0) (computed TRUE))
f-171   (heat-map (x 7) (y 7) (h 0) (computed TRUE))
f-172   (heat-map (x 8) (y 7) (h 0) (computed TRUE))
f-173   (heat-map (x 9) (y 7) (h 0) (computed TRUE))
f-174   (heat-map (x 0) (y 6) (h 5) (computed TRUE))
f-175   (heat-map (x 1) (y 6) (h 0) (computed TRUE))
f-176   (heat-map (x 2) (y 6) (h 0) (computed TRUE))
f-177   (heat-map (x 3) (y 6) (h 0) (computed TRUE))
f-178   (heat-map (x 4) (y 6) (h 100) (computed TRUE))
f-179   (heat-map (x 5) (y 6) (h 100) (computed TRUE))
f-180   (heat-map (x 6) (y 6) (h 8) (computed TRUE))
f-181   (heat-map (x 7) (y 6) (h 0) (computed TRUE))
f-182   (heat-map (x 8) (y 6) (h 4) (computed TRUE))
f-183   (heat-map (x 9) (y 6) (h 0) (computed TRUE))
f-184   (heat-map (x 0) (y 5) (h 0) (computed TRUE))
f-185   (heat-map (x 1) (y 5) (h 0) (computed TRUE))
f-186   (heat-map (x 2) (y 5) (h 0) (computed TRUE))
f-187   (heat-map (x 3) (y 5) (h 0) (computed TRUE))
f-188   (heat-map (x 4) (y 5) (h 0) (computed TRUE))
f-189   (heat-map (x 5) (y 5) (h 0) (computed TRUE))
f-190   (heat-map (x 6) (y 5) (h 0) (computed TRUE))
f-191   (heat-map (x 7) (y 5) (h 0) (computed TRUE))
f-192   (heat-map (x 8) (y 5) (h 0) (computed TRUE))
f-193   (heat-map (x 9) (y 5) (h 0) (computed TRUE))
f-194   (heat-map (x 0) (y 4) (h 8) (computed TRUE))
f-195   (heat-map (x 1) (y 4) (h 0) (computed TRUE))
f-196   (heat-map (x 2) (y 4) (h 0) (computed TRUE))
f-197   (heat-map (x 3) (y 4) (h 7) (computed TRUE))
f-198   (heat-map (x 4) (y 4) (h 9) (computed TRUE))
f-199   (heat-map (x 5) (y 4) (h 11) (computed TRUE))
f-200   (heat-map (x 6) (y 4) (h 11) (computed TRUE))
f-201   (heat-map (x 7) (y 4) (h 0) (computed TRUE))
f-202   (heat-map (x 8) (y 4) (h 7) (computed TRUE))
f-203   (heat-map (x 9) (y 4) (h 9) (computed TRUE))
f-204   (heat-map (x 0) (y 3) (h 0) (computed TRUE))
f-205   (heat-map (x 1) (y 3) (h 0) (computed TRUE))
f-206   (heat-map (x 2) (y 3) (h 0) (computed TRUE))
f-207   (heat-map (x 3) (y 3) (h 0) (computed TRUE))
f-208   (heat-map (x 4) (y 3) (h 0) (computed TRUE))
f-209   (heat-map (x 5) (y 3) (h 0) (computed TRUE))
f-210   (heat-map (x 6) (y 3) (h 0) (computed TRUE))
f-211   (heat-map (x 7) (y 3) (h 0) (computed TRUE))
f-212   (heat-map (x 8) (y 3) (h 0) (computed TRUE))
f-213   (heat-map (x 9) (y 3) (h 0) (computed TRUE))
f-214   (heat-map (x 0) (y 2) (h 5) (computed TRUE))
f-215   (heat-map (x 1) (y 2) (h 0) (computed TRUE))
f-216   (heat-map (x 2) (y 2) (h 0) (computed TRUE))
f-217   (heat-map (x 3) (y 2) (h 0) (computed TRUE))
f-218   (heat-map (x 4) (y 2) (h 100) (computed TRUE))
f-219   (heat-map (x 5) (y 2) (h 100) (computed TRUE))
f-220   (heat-map (x 6) (y 2) (h 8) (computed TRUE))
f-221   (heat-map (x 7) (y 2) (h 0) (computed TRUE))
f-222   (heat-map (x 8) (y 2) (h 4) (computed TRUE))
f-223   (heat-map (x 9) (y 2) (h 0) (computed TRUE))
f-224   (heat-map (x 0) (y 1) (h 0) (computed TRUE))
f-225   (heat-map (x 1) (y 1) (h 0) (computed TRUE))
f-226   (heat-map (x 2) (y 1) (h 0) (computed TRUE))
f-227   (heat-map (x 3) (y 1) (h 0) (computed TRUE))
f-228   (heat-map (x 4) (y 1) (h 0) (computed TRUE))
f-229   (heat-map (x 5) (y 1) (h 0) (computed TRUE))
f-230   (heat-map (x 6) (y 1) (h 0) (computed TRUE))
f-231   (heat-map (x 7) (y 1) (h 0) (computed TRUE))
f-232   (heat-map (x 8) (y 1) (h 0) (computed TRUE))
f-233   (heat-map (x 9) (y 1) (h 0) (computed TRUE))
f-234   (heat-map (x 0) (y 0) (h 100) (computed TRUE))
f-235   (heat-map (x 1) (y 0) (h 0) (computed TRUE))
f-236   (heat-map (x 2) (y 0) (h 0) (computed TRUE))
f-237   (heat-map (x 3) (y 0) (h 5) (computed TRUE))
f-238   (heat-map (x 4) (y 0) (h 7) (computed TRUE))
f-239   (heat-map (x 5) (y 0) (h 9) (computed TRUE))
f-240   (heat-map (x 6) (y 0) (h 9) (computed TRUE))
f-241   (heat-map (x 7) (y 0) (h 0) (computed TRUE))
f-242   (heat-map (x 8) (y 0) (h 5) (computed TRUE))
f-243   (heat-map (x 9) (y 0) (h 7) (computed TRUE))
f-244   (heat-map (x 0) (y 9) (h 100) (computed TRUE))
f-250   (exec (step 0) (action fire) (x 4) (y 6))
f-253   (k-cell (x 4) (y 6) (content top))
f-256   (k-cell (x 3) (y 5) (content water))
f-258   (k-cell (x 3) (y 6) (content water))
f-260   (k-cell (x 3) (y 7) (content water))
f-262   (k-cell (x 4) (y 5) (content water))
f-264   (k-cell (x 4) (y 7) (content water))
f-266   (k-cell (x 5) (y 5) (content water))
f-269   (k-cell (x 5) (y 7) (content water))
f-279   (exec (step 1) (action fire) (x 9) (y 6))
f-282   (exec (step 2) (action fire) (x 4) (y 2))
f-285   (k-cell (x 4) (y 2) (content top))
f-288   (k-cell (x 3) (y 1) (content water))
f-290   (k-cell (x 3) (y 2) (content water))
f-292   (k-cell (x 3) (y 3) (content water))
f-294   (k-cell (x 4) (y 1) (content water))
f-296   (k-cell (x 4) (y 3) (content water))
f-298   (k-cell (x 5) (y 1) (content water))
f-301   (k-cell (x 5) (y 3) (content water))
f-311   (exec (step 3) (action fire) (x 9) (y 2))
f-314   (exec (step 4) (action fire) (x 0) (y 0))
f-317   (k-cell (x 0) (y 0) (content sub))
f-321   (k-cell (x 9) (y 2) (content water))
f-322   (k-cell (x 9) (y 6) (content water))
For a total of 152 facts.
CLIPS>